[
    {
        "user": "U01UMEM51RA",
        "type": "message",
        "ts": "1629640977.000100",
        "bot_id": "B01V53YD4FJ",
        "text": "",
        "team": "T01DW9DLB2A",
        "bot_profile": {
            "id": "B01V53YD4FJ",
            "app_id": "A01BP7R4KNY",
            "name": "GitHub",
            "icons": {
                "image_36": "https:\/\/avatars.slack-edge.com\/2020-11-25\/1527503386626_319578f21381f9641cd8_36.png",
                "image_48": "https:\/\/avatars.slack-edge.com\/2020-11-25\/1527503386626_319578f21381f9641cd8_48.png",
                "image_72": "https:\/\/avatars.slack-edge.com\/2020-11-25\/1527503386626_319578f21381f9641cd8_72.png"
            },
            "deleted": false,
            "updated": 1618502163,
            "team_id": "T01DW9DLB2A"
        },
        "attachments": [
            {
                "fallback": "[forwards\/rcontribution] Issue opened by yabellini",
                "text": "I am one of the LatinR chairs that will take place during the week of November 10, 2021, in virtual format.  \nWe would very much like the work of this group to be featured.\n\n*General goals*\n\n• As a regional conference, we would like to highlight group members from our region and\/or who can speak in Spanish or Portuguese and cal told us about this group.\n• We would also like to publicize and bring resources closer so that more people from our region can participate and contribute.\n• We don't need (and I don't think we can) to do all of these potential alternatives this year, but I let this here because can be good ideas for the next editions.\n\n*Some alternatives:*\n*Guest talks*\n\nWe think a talk presenting the R Dev Guide is a very good topic. We would love Saranjeet can deliver the talk. We think that a good strategy can be if she can record the talk in English in advance, so we can translate subtitles to Spanish and Saranjeet can be there online while we play the video for the Q&amp;A session.\n\nbugRzilla by Lluís.\n\nWe could find out if any R Core members speak Spanish\/Portuguese. We will be very happy if some Core Team members want to deliver a talk also in English.\n\n*Panels*\n\nMemeber of this team that speak Spanish and can told about this group.\n\n*Tutorials*\n\nLatinR has a full week for tutorials previous to the conferences. All of them are free and we run them jointly with R-Ladies chapters and regional RUGs.\n\nRe-run the Contributing to R and\/or Translating R to you Language tutorials at LatinR (presumably focusing on Spanish and Portuguese in the second case).",
                "pretext": "New issue created by <https:\/\/github.com\/yabellini|yabellini>",
                "title": "<https:\/\/github.com\/forwards\/rcontribution\/issues\/9|#9 R Contribution Working Group in LatinR 2021 (and beyond)?>",
                "footer": "<https:\/\/github.com\/forwards\/rcontribution|forwards\/rcontribution>",
                "id": 1,
                "footer_icon": "https:\/\/slack.github.com\/static\/img\/favicon-neutral.png",
                "ts": 1629640976,
                "color": "36a64f",
                "mrkdwn_in": [
                    "text"
                ]
            }
        ]
    }
]