[
    {
        "user": "U01FGQ2PUL8",
        "type": "message",
        "ts": "1648483244.384139",
        "client_msg_id": "1c4ca29c-7f2c-426d-adb7-2b179f82af81",
        "text": "I’m not sure this is the right place for this question, but I figure it’s better than twitter. I haven’t been able to make the meetings for the R Contribution Working Group in a long while, so I’m wondering if there has been progress on a community letter\/movement for CRAN accountability. I’m catching up on messages in other slacks and can see three recent examples of what I was describe as abuse from CRAN. Has there been any movement on a process for adding new members to CRAN? A code of conduct for CRAN? Or any of the other stuff described in <@U029Q230U0M>’s letter, <https:\/\/github.com\/MilesMcBain\/cran_change.org\/blob\/main\/letter.md>?",
        "team": "T01DW9DLB2A",
        "user_team": "T01DW9DLB2A",
        "source_team": "T01DW9DLB2A",
        "user_profile": {
            "avatar_hash": "fc428dbde4e8",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-11-15\/1488237410135_fc428dbde4e8b4aeea3e_72.jpg",
            "first_name": "Amelia",
            "real_name": "Amelia McNamara (she\/her)",
            "display_name": "Amelia McNamara",
            "team": "T01DW9DLB2A",
            "name": "amelia.mcnamara",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "id": 1,
                "footer_icon": "https:\/\/slack.github.com\/static\/img\/favicon-neutral.png",
                "color": "24292f",
                "bot_id": "B01V53YD4FJ",
                "app_unfurl_url": "https:\/\/github.com\/MilesMcBain\/cran_change.org\/blob\/main\/letter.md",
                "is_app_unfurl": true,
                "app_id": "A01BP7R4KNY",
                "fallback": "<https:\/\/github.com\/MilesMcBain\/cran_change.org\/blob\/main\/letter.md | letter.md>",
                "text": "This letter seeks to draw attention to deficiencies in empathy and fairness that are impacting the R community.\n\nSo in the spirit of empathy and fairness we begin by acknowledging the sustained dedication of our CRAN administrators, and thank them for building the foundational piece of infrastructure which has made the way we work together with R possible.\n\nThere is no question that holding an ever increasing pool of software and contributors to high standards, and continuously validating those standards are held is a resource intensive technical feat from which great public good has been derived.\n\nYet it is also with empathy for the experiences of CRAN's users, and in fairness to the future R community that we, the undersigned R community members, find ourselves with no other reasonable alternative than to unify our voices in a call to reform CRAN practices that are damaging the R package ecosystem.\n\nA pattern of increasingly inconsistent and heavy-handed behaviour by CRAN administrators has shaken our trust that our community's central package archive is being managed sustainably.\n\nIf left unchecked we believe this pattern will undermine CRAN's position as a comprehensive archive of quality software, since is it already leading many of us to question whether submitting to CRAN is worthwhile, and wonder if tests deployed on CRAN are truly assets or liabilities.\n\nIn particular we believe three practices are harmful:\n\n*Rejecting submissions based on undocumented criteria, or inconsistently applied criteria* makes it difficult for contributors to predict if their submissions will be accepted without issues, and so erodes willingness to contribute. For example:\n\n• There seems to have been an undocumented change in stance toward examples, with many contributors reporting CRAN administrators are rejecting submissions citing not enough examples whilst also refusing to accept any examples with `\\dontrun{}` and `\\donttest{}`. These blocks were previously accepted as standard practice.\n• On multiple occasions packages premised on colour palettes have been rejected due to triviality only to have other packages with almost identical premises, and of similar complexity be accepted shortly after.\n\nThis practice wastes the time of both CRAN administrators and contributors. We believe the submission burden on both sides could be significantly reduced by fully documenting acceptance criteria, and reducing ambiguity with guidance and examples.\n\n*Archiving packages for a small number of test failures on proprietary platforms* harms package test coverage. For example:\n\n• Recently a package with 100% test coverage and over 2000 tests was archived when 2 of those tests began failing on an expensive proprietary platform. The failure could not be reproduced on RHub.\n\nThis practice discourages extensive testing on CRAN, and has already lead developers among us to limit functionality exposed to CRAN to low-risk subsets. The degradation of the reverse dependency checking system in this way weakens both packages and the R language itself, since package checks are used to validate core changes.\n\n*Archiving packages with little or no warning* discriminates against contributors with less time available on short notice. Typical periods attached to the threat of archival seem to range in zero to six weeks. Under this practice there are many categories of contributor who will find it difficult to keep their work on CRAN, for example:\n\n• Contributors who have no paid time to work on open source\n• Contributors with families or others who depend on them\n• Contributors who are unwell or on leave\n\nAside from the nature of these actions, the tone taken by CRAN administrators in their communications with contributors is at times abrupt and unsympathetic. This routinely takes new contributors by surprise since it is out of step with the norms of the larger R community.\n\nContributors are a precious resource and discouraging them threatens CRAN's 'comprehensive' aspect.\n\nThe fact that there is currently no avenue by which R community members can engage CRAN administrators on these topics points to an operating model that our community may have outgrown. There are aspects of the way CRAN works that we feel are unnecessarily opaque, and incompatible with the open nature of the R community and its other governing bodies.\n\nWe therefore propose the following reforms to CRAN to ensure a robust, comprehensive, and diverse R package ecosystem:\n\n1. Consult with the community to create a policy on archival. For example: Minimum 6 weeks for policy change, 6 weeks for failing tests. 12 weeks for tests failing on platforms that are difficult to access\n2. Standardise build environments and publish reproducible configuration so that contributors can test against CRAN environments, e.g. via RHub\n3. Publish a single exhaustive and authoritative source of criteria that a package must meet to be accepted on CRAN\n4. Consult with the community to create a CRAN editorial policy that can be consistently applied. Do we want CRAN rejecting packages based on qualitative assessments of content? Detailed criteria must be published if so. For example: <https:\/\/devguide.ropensci.org\/policies.html#policies|https:\/\/devguide.ropensci.org\/policies.html#policies>\n5. If CRAN modifies a package's source code for any reason this must be made clear to maintainers and users. Maintainers should receive an email, the package version number should be bumped, and users should receive an onLoad message\n6. Publish a policy on re-submission intervals that can be consistently applied\n7. Cease punitive temporary submission bans for contributors with repeated rejections or test failures\n8. Establish a governance model including a process by which community members can propose changes to CRAN policies or processes. For example the PEP system in Python\n9. Establish a code of conduct for the behaviour of CRAN administrators and contributors in their dealings\n10. Publish minutes of CRAN governence meetings\n11. Establish a process whereby CRAN notifies the R community of shortfalls in resources which could be met by community contributions\n\nWe appreciate a lot of reform is being sought from what is a famously small team of administrators. However, being under-resourced does not mitigate the damage being done by CRAN's current practices, rather it is an argument in itself that reform is needed so that CRAN may attract the resources to perform its valuable role sustainably.\n\n*Supporting this petition*\n\nWith this action we wish to advocate for a respectful dialogue about reforming the administration of CRAN's package ecosystem. We do not wish to disparage the contributions that have been provided to this point by CRAN administrators.\n\nIn addition to signing the petition there are several steps R community members can take to show their support for these reforms:\n\n1. Share this petition with your networks\n2. Withhold submitting new packages or new features to CRAN where you are comfortable doing so, and use this badge in your README [BADGE URL]\n3. Configure alternative package repositories where you trust the developers e.g. <https:\/\/r-universe.dev|https:\/\/r-universe.dev> for rOpensci, RStudio et. al. packages\n4. Contribute your own packages to alternative repositories and advertise these ways to install them in your README\n5. refer to the CRAN team as \"CRAN administrators\" rather than their self-assigned label of \"volunteers\". This label describes a role which we can clarify the expectations of as opposed to a remuneration status.",
                "title": "<https:\/\/github.com\/MilesMcBain\/cran_change.org\/blob\/main\/letter.md | letter.md>",
                "footer": "<https:\/\/github.com\/MilesMcBain\/cran_change.org|MilesMcBain\/cran_change.org>",
                "mrkdwn_in": [
                    "text"
                ]
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "LCy0",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "I’m not sure this is the right place for this question, but I figure it’s better than twitter. I haven’t been able to make the meetings for the R Contribution Working Group in a long while, so I’m wondering if there has been progress on a community letter\/movement for CRAN accountability. I’m catching up on messages in other slacks and can see three recent examples of what I was describe as abuse from CRAN. Has there been any movement on a process for adding new members to CRAN? A code of conduct for CRAN? Or any of the other stuff described in "
                            },
                            {
                                "type": "user",
                                "user_id": "U029Q230U0M"
                            },
                            {
                                "type": "text",
                                "text": "’s letter, "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/github.com\/MilesMcBain\/cran_change.org\/blob\/main\/letter.md"
                            },
                            {
                                "type": "text",
                                "text": "?"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user": "U01ECGRL8CB",
        "type": "message",
        "ts": "1648486716.349219",
        "client_msg_id": "7460031a-9bd3-4f67-a6d4-d9c20b8baad6",
        "text": "Hi <@U01FGQ2PUL8>,\n\nAs far as I understand, that’s never been something we intended to address in the R contributions working group, as it is focused on fostering, encouraging, and empowering contributions to the R project (which CRAN is technically not a part). That said, there is another working group surrounding repositories which has some of the same people (myself included) and some different people involved.  That working group has some plans to engage with CRAN that are ongoing but I wouldn’t describe it as there having been a lot of movement.",
        "team": "T01DW9DLB2A",
        "user_team": "T01DW9DLB2A",
        "source_team": "T01DW9DLB2A",
        "user_profile": {
            "avatar_hash": "39f1ac18bd8d",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-11-09\/1481632125366_39f1ac18bd8d2e8902f0_72.png",
            "first_name": "",
            "real_name": "Gabriel Becker",
            "display_name": "Gabriel Becker",
            "team": "T01DW9DLB2A",
            "name": "gabembecker",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1648486716.349219",
        "reply_count": 91,
        "reply_users_count": 3,
        "latest_reply": "1652740164.225229",
        "reply_users": [
            "U01ECGRL8CB",
            "U01FGQ2PUL8",
            "U03FGR4C49G"
        ],
        "replies": [
            {
                "user": "U01ECGRL8CB",
                "ts": "1648486899.065859"
            },
            {
                "user": "U01FGQ2PUL8",
                "ts": "1648487015.214539"
            },
            {
                "user": "U01FGQ2PUL8",
                "ts": "1648487099.112799"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652583933.489439"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652584168.737879"
            },
            {
                "user": "U01FGQ2PUL8",
                "ts": "1652668547.630749"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652737220.991789"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652737476.671239"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652737501.829409"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652737547.612319"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652737569.661189"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652737574.206809"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652737599.060919"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652737601.992219"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652737650.469629"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652737728.957709"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652737788.329489"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738366.538769"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738530.930599"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738548.502799"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738596.334679"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738617.683109"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738692.669819"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738706.798459"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738764.389469"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738770.682159"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738781.922819"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738791.888469"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738794.504279"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738795.834989"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738806.222829"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738827.776559"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738831.686949"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738841.275309"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738864.598149"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738876.285849"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738885.827729"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738914.957549"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652738969.133539"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652738984.289709"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739028.313719"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739041.296599"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739042.523289"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739093.301089"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739113.235389"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739143.528799"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739158.075889"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739180.898059"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739206.756569"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739222.075209"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739227.604739"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739241.805059"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739263.479479"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739278.210649"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739278.870079"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739297.076179"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739308.016469"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739320.678839"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739325.686689"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739329.151679"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739367.495939"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739372.318379"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739396.608109"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739412.641399"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739422.173109"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739425.793569"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739439.431639"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739445.378999"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739452.865489"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739476.592089"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739554.683019"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739577.547419"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739595.768129"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739710.362509"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739753.232829"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739759.950759"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739776.359919"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739821.389399"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739841.734169"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652739918.579519"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739929.050959"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739936.535959"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652739950.941549"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652740021.252579"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652740024.248179"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652740035.892149"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652740080.467439"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652740087.249119"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652740123.573969"
            },
            {
                "user": "U03FGR4C49G",
                "ts": "1652740150.728249"
            },
            {
                "user": "U01ECGRL8CB",
                "ts": "1652740164.225229"
            }
        ],
        "is_locked": false,
        "subscribed": false,
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "Fd4",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Hi "
                            },
                            {
                                "type": "user",
                                "user_id": "U01FGQ2PUL8"
                            },
                            {
                                "type": "text",
                                "text": ",\n\nAs far as I understand, that’s never been something we intended to address in the R contributions working group, as it is focused on fostering, encouraging, and empowering contributions to the R project (which CRAN is technically not a part). That said, there is another working group surrounding repositories which has some of the same people (myself included) and some different people involved.  That working group has some plans to engage with CRAN that are ongoing but I wouldn’t describe it as there having been a lot of movement."
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user": "U01ECGRL8CB",
        "type": "message",
        "ts": "1648486899.065859",
        "client_msg_id": "c8180553-c962-4264-a6dc-f15c085e2733",
        "text": "Speaking for myself (and not the workgroup as a whole), in terms of the letter you linked to, in the form it was in when I was engaging on that repo, I think sending it would have been much more likely to backfire than foster any of the desired changes, regardless of the underlying motivations their justifications. (I said as much in the discussions there)",
        "team": "T01DW9DLB2A",
        "user_team": "T01DW9DLB2A",
        "source_team": "T01DW9DLB2A",
        "user_profile": {
            "avatar_hash": "39f1ac18bd8d",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-11-09\/1481632125366_39f1ac18bd8d2e8902f0_72.png",
            "first_name": "",
            "real_name": "Gabriel Becker",
            "display_name": "Gabriel Becker",
            "team": "T01DW9DLB2A",
            "name": "gabembecker",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1648486716.349219",
        "parent_user_id": "U01ECGRL8CB",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "uBlo",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Speaking for myself (and not the workgroup as a whole), in terms of the letter you linked to, in the form it was in when I was engaging on that repo, I think sending it would have been much more likely to backfire than foster any of the desired changes, regardless of the underlying motivations their justifications. (I said as much in the discussions there)"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user": "U01FGQ2PUL8",
        "type": "message",
        "ts": "1648487015.214539",
        "client_msg_id": "91e818af-d664-4510-97a6-efad58c22742",
        "text": "Thanks! Part of my problem is always mixing up\/conflating R Core and CRAN. You’d think after all these years I would remember. I recall some conversation about upskilling folks so they would have the qualifications\/track record to be added to an official group, but I’m guessing what I remember was about getting folks more experience contributing to R so they could potentially eventually join the Core team, not CRAN.",
        "team": "T01DW9DLB2A",
        "user_team": "T01DW9DLB2A",
        "source_team": "T01DW9DLB2A",
        "user_profile": {
            "avatar_hash": "fc428dbde4e8",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-11-15\/1488237410135_fc428dbde4e8b4aeea3e_72.jpg",
            "first_name": "Amelia",
            "real_name": "Amelia McNamara (she\/her)",
            "display_name": "Amelia McNamara",
            "team": "T01DW9DLB2A",
            "name": "amelia.mcnamara",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1648486716.349219",
        "parent_user_id": "U01ECGRL8CB",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "q5B17",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Thanks! Part of my problem is always mixing up\/conflating R Core and CRAN. You’d think after all these years I would remember. I recall some conversation about upskilling folks so they would have the qualifications\/track record to be added to an official group, but I’m guessing what I remember was about getting folks more experience contributing to R so they could potentially eventually join the Core team, not CRAN."
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user": "U01FGQ2PUL8",
        "type": "message",
        "ts": "1648487099.112799",
        "client_msg_id": "072c1ff5-5335-4214-a910-29941fac93d3",
        "text": "Totally valid that an open letter may not be the way to get change to happen with CRAN. Glad to hear there is a workgroup that has plans to engage with CRAN, and look forward to what y’all come up with!",
        "team": "T01DW9DLB2A",
        "user_team": "T01DW9DLB2A",
        "source_team": "T01DW9DLB2A",
        "user_profile": {
            "avatar_hash": "fc428dbde4e8",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-11-15\/1488237410135_fc428dbde4e8b4aeea3e_72.jpg",
            "first_name": "Amelia",
            "real_name": "Amelia McNamara (she\/her)",
            "display_name": "Amelia McNamara",
            "team": "T01DW9DLB2A",
            "name": "amelia.mcnamara",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1648486716.349219",
        "parent_user_id": "U01ECGRL8CB",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "4J3",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Totally valid that an open letter may not be the way to get change to happen with CRAN. Glad to hear there is a workgroup that has plans to engage with CRAN, and look forward to what y’all come up with!"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]