[
    {
        "user": "U01KXU8UNRX",
        "type": "message",
        "ts": "1626214054.028400",
        "client_msg_id": "c79c7ead-a7d3-4614-8c82-d5448c89af37",
        "text": "There is a letter with some suggestions to change CRAN: <https:\/\/github.com\/cranchange\/cran_change.org\/blob\/main\/letter.md>. There has been some discussion about which suggestions are good and which not and how to make them happen. Feedback on the suggestions and advice as to how best to realise them with minimal harm will be appreciated. Many thanks!",
        "team": "T01DW9DLB2A",
        "user_team": "T01DW9DLB2A",
        "source_team": "T01DW9DLB2A",
        "user_profile": {
            "avatar_hash": "ad5dd68cbc81",
            "image_72": "https:\/\/avatars.slack-edge.com\/2021-01-22\/1671554425412_ad5dd68cbc8196426bd1_72.png",
            "first_name": "Lluís",
            "real_name": "Lluís Revilla Sancho",
            "display_name": "Lluís Revilla Sancho",
            "team": "T01DW9DLB2A",
            "name": "lluis.revilla_slack",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "text": "The Comprehensive R Archive Network (CRAN) is exceptional infrastructure. Thanks to high standards for contributions and a thorough continuous checking system, users can trust that any package from CRAN is likely to work, be compatible with other CRAN packages, and leave the local R package library in a consistent state. These guarantees are fundamental to the success and popularity of R, and they would not be possible without the diligence of the CRAN team.\n\nBecause of its success, CRAN has become a fundamental global resource, not only for independent researchers, but also for large organizations across academia, government, and industry, all of whom depend on the ability to contribute packages in a reliable and predictable manner. Due to the seriousness and breadth of the need, it is right and proper for the worldwide community that CRAN serves to influence the conduct and administration of CRAN.\n\nWe, the undersigned R community members, are unified in our concern that CRAN is struggling to provide a consistent experience for contributors.\n\nThe CRAN Repository Policy omits some criteria routinely used to review submissions, new criteria are sometimes introduced without notice, and enforcement practices can be discourteous and severe. Contributors are experiencing ambiguity and disruption, leaving them, along with some CRAN administrators, frustrated and discouraged.\n\nIn order to adapt, contributors are reluctantly adopting harmful shortcuts to reduce exposure to CRAN's policies and checks, such as skipping all tests and examples on CRAN. This not only undermines CRAN's check system but also the R language itself since CRAN checks are used to validate core changes. And the ambiguity in requirements adds to the workload of CRAN administrators as well as contributors.\n\nTo reverse these trends, we are petitioning CRAN for reform. We request measures that:\n\n• Establish channels for CRAN collaboration with the R community.\n• Clarify criteria for packages to be accepted on CRAN.\n• Ensure a predictable experience for contributors.\n• Ensure CRAN is accessible to a diverse set of contributors.\n\nCommunication between the community and CRAN precedes our other proposed reforms, and improving transparency and information flow is likely to be a precondition for attracting additional resources for CRAN's important work. Package contributors currently have difficulty engaging CRAN on the topics described here, and we request an avenue for ongoing dialogue with the community.\n\nMany of our proposals have the capacity to reduce the burden on CRAN administrators as well as contributors, making contributing to the R ecosystem more efficient and pleasant for all.\n\nWe therefore petition CRAN's administrators to make the following reforms to ensure CRAN continues to serve the R community as a robust, comprehensive, and diverse R package ecosystem:\n\n*1. Consult with the community to create a policy on archival.*\n\nCharitable timelines for contributors to fix issues promote diversity within the contributor community. Short timelines, like 2 weeks, make it challenging for some to keep their work on CRAN, for example:\n\n• Contributors who have no paid time to work on open source\n• Contributors with families or others who depend on them\n• Contributors who are unwell or on leave\n\nPresenting achievable deadlines is likely to encourage contributors to implement fixes before they expire, since many anecdotes point to a higher standard of review being applied to packages attempting to return from the archive. It would also make sense to formalise this notion of a higher review standard in policy to help contributors understand the ramifications of missing a deadline.\n\nTimelines could also vary by issue type, for example: 6 weeks for policy change, 6 weeks for failing tests. 12 weeks for tests failing on platforms that are difficult to access.\n\nWith this policy in place CRAN administrators benefit from having to archive less often, and spend less time reviewing archived package re-submissions. Simultaneously, the whole community benefits from a diverse pool of contributors that helps ensure CRAN continues to offer tools that meet ever-evolving needs.\n\n*2. Standardise build environments and publish reproducible configuration.*\n\nExpecting contributors to ensure no test failures in environments they cannot access guarantees CRAN administrators will be burdened by chasing contributors for fixes for those environments. When that happens, contributors are burdened by challenges in diagnosing issues in those environments.\n\nHaving reproductions of CRAN's environments available on infrastructure like RHub or GitHub actions could greatly reduce instances of platform specific issues making their way onto CRAN.\n\n*3. Publish a single exhaustive and authoritative source of criteria that a package must meet to be accepted on CRAN.*\n\nFully documenting criteria, like for example the current stance on `\\donttest`\/`\\donttrun`, or providing detailed guidance as to the interpretation of terms like \"publication quality\" and \"trivial\" has the potential to significantly reduce the submission burden for administrators and contributors. An increased ability for contributors to predict if their package is CRAN-ready may also bolster will to contribute.\n\n*4. Consult with the community to create or modify CRAN policy.*\n\nPublicly flagging policy changes some time before they come into effect can reduce policy ignorance and the associated burden of policy enforcement on CRAN administrators. It would also give contributors a chance to bring their work into line with policy without requiring threat of archive, reducing pressure and frustration.\n\nPublicly consulting on policy with the community has the added benefit of potentially identifying policies that stifle innovation in unexpected ways, or will motivate unanticipated work-arounds. These insights can reduce policy churn in the long term, along with associated administrator enforcement burden and contributor frustration.\n\n*5. Notify maintainers and users of any modifications made by CRAN to a package's source code.*\n\nWhen parties are unaware of CRAN modifications unfortunate wasteful events have been observed to occur:\n\n• Authors unknowingly undo CRAN's changes in a subsequent submission causing problems that cost contributors and administrators time.\n• Users submit bug reports relating to CRAN changes leading to difficulty in reproducing issues.\n\nIt seems that some of these modifications may relate to intricacies of CRAN's environments, a further argument for reform 3.\n\nAt a minimum we propose that maintainers should receive an email, the package version number should be bumped, and users should receive an onLoad message.\n\n*6. Publish a policy on re-submission intervals that can be consistently applied.*\n\nA recurring source of conflict between administrators and contributors arises when contributors submit too frequently. This may be due to the fact that the allowable frequency of submissions is left rubbery in CRAN policy. It is also unclear if submissions made at CRAN's request are included a contributor's notional quota.\n\nThis conflict could be removed if contributors received a set number of submissions per period. CRAN systems could automatically ensure they don't submit more than this, and it could be clear to contributors at all times how many submissions they have, or how long until they can next submit. Additional quota could be granted when making submissions requested by CRAN administrators.\n\n*7. Cease punitive temporary submission bans for contributors with repeated rejections or test failures.*\n\nAdministrators issuing punishments is a cumbersome process that involves effort in decision making, communication, and bookkeeping. Time can be saved by replacing it with more transparent, and automatic processes wherever possible. For example:\n\n• Test failures could trigger automatic notifications, and automatically result in archival if they reach a pers…",
                "title": "<https:\/\/github.com\/cranchange\/cran_change.org\/blob\/main\/letter.md | letter.md>",
                "footer": "<https:\/\/github.com\/cranchange\/cran_change.org|cranchange\/cran_change.org>",
                "id": 1,
                "footer_icon": "https:\/\/slack.github.com\/static\/img\/favicon-neutral.png",
                "color": "24292f",
                "mrkdwn_in": [
                    "text"
                ],
                "fallback": "<https:\/\/github.com\/cranchange\/cran_change.org\/blob\/main\/letter.md | letter.md>",
                "bot_id": "B01V53YD4FJ",
                "app_unfurl_url": "https:\/\/github.com\/cranchange\/cran_change.org\/blob\/main\/letter.md",
                "is_app_unfurl": true
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "1MWi",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "There is a letter with some suggestions to change CRAN: "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/github.com\/cranchange\/cran_change.org\/blob\/main\/letter.md"
                            },
                            {
                                "type": "text",
                                "text": ". There has been some discussion about which suggestions are good and which not and how to make them happen. Feedback on the suggestions and advice as to how best to realise them with minimal harm will be appreciated. Many thanks!"
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U01N3ET8N82",
                    "U021D972JJY",
                    "U021X72PVRN",
                    "U02186FB0UB",
                    "U01LM3R61HV"
                ],
                "count": 5
            }
        ]
    }
]