[
    {
        "user": "U051T8Z320J",
        "type": "message",
        "ts": "1690592961.136529",
        "edited": {
            "user": "U051T8Z320J",
            "ts": "1690593042.000000"
        },
        "client_msg_id": "927ff236-e846-4177-9291-09f9858c0a1c",
        "text": "Hello folks, my team is hiring for a Software and Reproducibility Software Developer: <https:\/\/careers-fhcrc.icims.com\/jobs\/25740\/job?hub=7&amp;mobile=false&amp;width=1300&amp;height=500&amp;bga=true&amp;needsRedirect=false&amp;jan1offset=-480&amp;jun1offset=-420>\n\n\nIf you have any questions, please connect with Sean Kross on LinkedIn and ask him through direct message: <https:\/\/www.linkedin.com\/in\/seankross\/>",
        "team": "T01DW9DLB2A",
        "user_team": "T01DW9DLB2A",
        "source_team": "T01DW9DLB2A",
        "user_profile": {
            "avatar_hash": "9c50c6a52b6e",
            "image_72": "https:\/\/avatars.slack-edge.com\/2023-04-05\/5091328490016_9c50c6a52b6e1e71102e_72.jpg",
            "first_name": "Howard",
            "real_name": "Howard Baek",
            "display_name": "Howard Baek",
            "team": "T01DW9DLB2A",
            "name": "howardbaek",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "from_url": "https:\/\/careers-fhcrc.icims.com\/jobs\/25740\/job?hub=7&mobile=false&width=1300&height=500&bga=true&needsRedirect=false&jan1offset=-480&jun1offset=-420",
                "service_icon": "https:\/\/careers-fhcrc.icims.com\/favicon.ico",
                "thumb_url": "https:\/\/fhcrc.icims.com\/icims2\/servlet\/icims2?module=AppInert&action=download&id=482216&hashed=-626439620",
                "thumb_width": 212,
                "thumb_height": 68,
                "id": 1,
                "original_url": "https:\/\/careers-fhcrc.icims.com\/jobs\/25740\/job?hub=7&amp;mobile=false&amp;width=1300&amp;height=500&amp;bga=true&amp;needsRedirect=false&amp;jan1offset=-480&amp;jun1offset=-420",
                "fallback": "FHCRC_Careers: Software and Reproducibility Software Developer in Seattle, Washington | Careers at   Fred Hutchinson Cancer Research Center &amp; Seattle Cancer Care Alliance",
                "text": "Fred Hutchinson Cancer Center is an independent, nonprofit organization providing adult cancer treatment and groundbreaking research focused on cancer and infectious diseases. Based in Seattle, Fred Hutch is the only National Cancer Institute-designated cancer center in Washington.\n \nWith a track record of global leadership in bone marrow transplantation, HIV\/AIDS prevention, immunotherapy and COVID-19 vaccines, Fred Hutch has earned a reputation as one of the world’s leading cancer, infectious disease and biomedical research centers. Fred Hutch operates eight clinical care sites that provide medical oncology, infusion, radiation, proton therapy and related services, and network affiliations with hospitals in five states. Together, our fully integrated research and clinical care teams seek to discover new cures to the world’s deadliest diseases and make life beyond cancer a reality.\n \nAt Fred Hutch we value collaboration, compassion, determination, excellence, innovation, integrity and respect. These values are grounded in and expressed through the principles of diversity, equity and inclusion. Our mission is directly tied to the humanity, dignity and inherent value of each employee, patient, community member and supporter. Our commitment to learning across our differences and similarities make us stronger. We seek employees who bring different and innovative ways of seeing the world and solving problems. Fred Hutch is in pursuit of becoming an anti-racist organization. We are committed to ensuring that all candidates hired share our commitment to diversity, anti-racism and inclusion.\n\nThe Chief Data Officer of the Fred Hutchinson Cancer Center, Jeff Leek, established the Fred Hutch Data Science Lab (DaSL) to develop and support the overall data strategy for the organization. The mission of the Data Science Lab to ensure an effective data ecosystem at Fred Hutch by developing a modern, well documented, well implemented, overall data strategy that evolves with the needs and capabilities of those leveraging data at Fred Hutch regardless of “where they live” from the clinic to the research groups. We believe focusing on people is critical in building a strong, dynamic community united around using data to improve human health and cancer care. To do this, we aim to build a diverse, hybrid team that is inclusive, open, collaborative, and supportive both within our team and with our collaborators (find more about our values and culture). We are strong advocates for open science and reproducible research, thus develop our work in the open as much as possible. We rely heavily on written communication and continuous collaboration in order to support our hybrid team, as well as make our work as accessible as scalably and sustainably as possible by Fred Hutch staff. \n \nThe Software and Reproducibility Software Developer works with other DaSL staff to build and share efficient software, containerize software, and support CI\/testing of software and workflow resources created by DaSL. Develops software and toolingto facilitate multimodal clinical data integration, data munging and data formatting to feed and coordinate data between DaSL’s data resources and IT supported data sources and research applications.  ",
                "title": "Software and Reproducibility Software Developer in Seattle, Washington | Careers at   Fred Hutchinson Cancer Research Center &amp; Seattle Cancer Care Alliance",
                "title_link": "https:\/\/careers-fhcrc.icims.com\/jobs\/25740\/job?hub=7&mobile=false&width=1300&height=500&bga=true&needsRedirect=false&jan1offset=-480&jun1offset=-420",
                "service_name": "FHCRC_Careers"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "tW5",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Hello folks, my team is hiring for a Software and Reproducibility Software Developer: "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/careers-fhcrc.icims.com\/jobs\/25740\/job?hub=7&mobile=false&width=1300&height=500&bga=true&needsRedirect=false&jan1offset=-480&jun1offset=-420"
                            },
                            {
                                "type": "text",
                                "text": "\n\n\nIf you have any questions, please connect with Sean Kross on LinkedIn and ask him through direct message: "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/www.linkedin.com\/in\/seankross\/"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]