[
    {
        "user": "U06F2AKNWSX",
        "type": "message",
        "ts": "1746058083.453939",
        "client_msg_id": "6FE2579D-02E8-4AEC-BEC6-97D3298818ED",
        "text": ":deer:  Sharing this role from The Hartford which features ownership and improvement of a modeling tool in R. \n<https:\/\/thehartford.wd5.myworkdayjobs.com\/en-US\/Careers_External\/job\/Hartford-CT\/Group-Benefits---Modeling-and-Planning_R2520601?jobFamilyGroup=5d03d31a903d017d8a551ee5774c6228|https:\/\/thehartford.wd5.myworkdayjobs.com\/en-US\/Careers_External\/job\/Hartford-CT\/Group-Benefits---Modeling-and-Planning_R2520601?jobFamilyGroup=5d03d31a903d017d8a551ee5774c6228>",
        "team": "T01DW9DLB2A",
        "user_team": "T01DW9DLB2A",
        "source_team": "T01DW9DLB2A",
        "user_profile": {
            "avatar_hash": "909e4a62bd9d",
            "image_72": "https:\/\/avatars.slack-edge.com\/2024-05-23\/7166506751971_909e4a62bd9db50bb8f5_72.png",
            "first_name": "Jasmine",
            "real_name": "Jasmine Daly",
            "display_name": "Jasmine Daly",
            "team": "T01DW9DLB2A",
            "name": "jasmine.dumas",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "image_url": "https:\/\/thehartford.wd5.myworkdayjobs.com\/en-US\/Careers_External\/assets\/logo",
                "image_width": 1200,
                "image_height": 630,
                "image_bytes": 19988,
                "from_url": "https:\/\/thehartford.wd5.myworkdayjobs.com\/en-US\/Careers_External\/job\/Hartford-CT\/Group-Benefits---Modeling-and-Planning_R2520601?jobFamilyGroup=5d03d31a903d017d8a551ee5774c6228",
                "service_icon": "https:\/\/thehartford.wd5.myworkdayjobs.com\/favicon.ico",
                "id": 1,
                "original_url": "https:\/\/thehartford.wd5.myworkdayjobs.com\/en-US\/Careers_External\/job\/Hartford-CT\/Group-Benefits---Modeling-and-Planning_R2520601?jobFamilyGroup=5d03d31a903d017d8a551ee5774c6228",
                "fallback": "Sr Consultant - Actuarial Support",
                "text": "AD &amp; Sr Actuarial Cons - AN07BE We’re determined to make a difference and are proud to be an insurance company that goes well beyond coverages and policies. Working here means having every opportunity to achieve your goals – and to help others accomplish theirs, too. Join our team as we help shape the future. GBD helps millions of everyday Americans ensure that when accidents and illnesses happen, their families don't also have to deal with financial difficulties. The Hartford is a mover and a shaker in the industry - we're one of the largest and fastest growing (a rare combination) providers of employee benefits in the U.S. In addition to our rapid growth, we've developed an enviable reputation as one of the most financially disciplined writers in the business. The AD &amp; Actuarial Associate position supports Group Benefits Pricing efforts across all product lines as part of annual target-setting and financial operating plan (Op Plan) processes through maintenance and enhancement of the Case Projections Tool, an R-based solution. This position also supports the Pricing and Underwriting Case Renewal Modeling, by forecasting case-level premium rate changes and the associated persistency at policy renewal. Lastly, this position is responsible for collaborating with Valuation and ERM-ALM to ensure GB’s book of business continues to be adequately hedged through periodic liability and liquidity modeling. Opportunities: • Interact and collaborate with both actuaries and non-actuaries in a team-based environment. • Exposure to all products offered in the Group Benefits insurance product suite (Life, STD, LTD, SADD, Supp Health). • Own individual projects and processes and see them through from start to finish. • Develop technical skills in R while also gaining and refining “soft skills”. Responsibilities of this position include: • Case Projections Tool (CPT) • Assist in the development of required premium for use in GB Pricing’s annual target-setting process • Support the annual Op Plan process through generation of premium and loss ratio projections • Leverage R coding skills to maintain and enhance the CPT by streamlining existing code and incorporating additional products and features • Collaborate with colleagues in GB Pricing to develop, implement and test coding solutions to meet business needs • Case Renewal Modeling • Own Excel-based modeling with a focus on improving upon the current state process • Liability &amp; Liquidity Modeling • Coordinate monthly with Valuation and ERM to monitor the duration of our liabilities so HIMCO can manage the asset portfolio accordingly • Quarterly review of the liquidity needs to ensure we have enough cash available Qualifications • 3+ years of experience in an actuarial or related analytical function. • Actuarial credential not required • Strong analytical skills, including strong Excel\/VBA\/Access skills. • Experience assessing risk and knowledge of Group Benefits product pricing and rating techniques preferred. • Database experience with R or other similar programming language preferred. • Experience participating in project-based work, collaborating with actuaries and non-actuaries to achieve intended results. • Effective written and verbal communication and general business management skills are imperative. • Intellectual curiosity and strong desire to further one’s knowledge of both the current and forward-looking Group Benefits landscape. Behaviors at the Hartford • Deliver Outcomes – Demonstrate a bias for speed and execution that serves our shareholders and customers. • Operate as a Team Player – Work together to drive solutions for the good of The Hartford. • Build Strong Partnerships – Demonstrate integrity and build trust with others. • Strive for Excellence – Motivate yourself and others to achieve high standards and continuously improve. ***No Exam Support Provided for this Role Compensation The listed annualized base pay range is primarily based on analysis of similar positions in the external market. Actual base pay could vary and may be above or below the listed range based on factors including but not limited to performance, proficiency and demonstration of competencies required for the role. The base pay is just one component of The Hartford’s total compensation package for employees. Other rewards may include short-term or annual bonuses, long-term incentives, and on-the-spot recognition. The annualized base pay range for this role is: $93,040 - $139,560 Equal Opportunity Employer\/Females\/Minorities\/Veterans\/Disability\/Sexual Orientation\/Gender Identity or Expression\/Religion\/Age About Us | Culture &amp; Employee Insights | Diversity, Equity and Inclusion | Benefits Human achievement is at the heart of what we do. We believe that with the right encouragement and support, people are capable of achieving amazing things. We put our belief into action by ensuring individuals and businesses are well protected, and by going even further – making an impact in ways that go beyond an insurance policy. Nearly 19,000 employees use their unique talents in careers that span a variety of disciplines – from developing the latest technology to creating and promoting our products to evaluating future financial risks. We’re also committed to programs that drive education and support volunteerism, which put human beings first. We do it because it’s the right thing to do, and because when our customers, communities and employees succeed, we all do. About Us Culture &amp; Employee Insights Diversity, Equity and Inclusion Benefits Legal Notice Accessibility Statement Producer Compensation EEO Privacy Policy California Privacy Policy Your California Privacy Choices International Privacy Policy Canadian Privacy Policy Unincorporated Areas of LA County, CA (Applicant Information)",
                "title": "Sr Consultant - Actuarial Support",
                "title_link": "https:\/\/thehartford.wd5.myworkdayjobs.com\/en-US\/Careers_External\/job\/Hartford-CT\/Group-Benefits---Modeling-and-Planning_R2520601?jobFamilyGroup=5d03d31a903d017d8a551ee5774c6228",
                "service_name": "thehartford.wd5.myworkdayjobs.com"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "4agyn",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "emoji",
                                "name": "deer",
                                "unicode": "1f98c"
                            },
                            {
                                "type": "text",
                                "text": "  Sharing this role from The Hartford"
                            },
                            {
                                "type": "text",
                                "text": " which features ownership and improvement of a modeling tool in R. \n"
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/thehartford.wd5.myworkdayjobs.com\/en-US\/Careers_External\/job\/Hartford-CT\/Group-Benefits---Modeling-and-Planning_R2520601?jobFamilyGroup=5d03d31a903d017d8a551ee5774c6228",
                                "text": "https:\/\/thehartford.wd5.myworkdayjobs.com\/en-US\/Careers_External\/job\/Hartford-CT\/Group-Benefits---Modeling-and-Planning_R2520601?jobFamilyGroup=5d03d31a903d017d8a551ee5774c6228"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]